driver-tests/bpelse/assign/VariablePropertyTest/VariableProperty1Bpel/src/InIf3/InIf3.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="InIf3" targetNamespace="http://j2ee.netbeans.org/wsdl/InIf3"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/InIf3" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns0="http://xml.netbeans.org/schema/simple" xmlns:vprop="http://docs.oasis-open.org/wsbpel/2.0/varprop">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/InIf3" xmlns:ns0="http://xml.netbeans.org/schema/simple">
            <xsd:import schemaLocation="../simple.xsd" namespace="http://xml.netbeans.org/schema/simple"/>
        </xsd:schema>
    </types>
    <message name="InIf3OperationRequest">
        <part name="inputPart" element="ns0:itemElem"/>
    </message>
    <message name="InIf3OperationResponse">
        <part name="outputPart" type="xsd:string"/>
    </message>
    <portType name="InIf3PortType">
        <operation name="InIf3Operation">
            <input name="input1" message="tns:InIf3OperationRequest"/>
            <output name="output1" message="tns:InIf3OperationResponse"/>
        </operation>
    </portType>
    <binding name="InIf3Binding" type="tns:InIf3PortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="InIf3Operation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/InIf3"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/InIf3"/>
            </output>
        </operation>
    </binding>
    <service name="InIf3Service">
        <port name="InIf3Port" binding="tns:InIf3Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/InIf3Service/InIf3Port"/>
        </port>
    </service>
    <plnk:partnerLinkType name="InIf3">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="InIf3PortTypeRole" portType="tns:InIf3PortType"/>
    </plnk:partnerLinkType>
    <vprop:property name="intProperty" type="xsd:int"/>
    <vprop:property name="boolProperty" type="xsd:boolean"/>
    <vprop:propertyAlias propertyName="tns:intProperty" element="ns0:itemElem">
        <vprop:query>/ns0:itemElem/ns0:price</vprop:query>
    </vprop:propertyAlias>
    <vprop:propertyAlias propertyName="tns:boolProperty" element="ns0:itemElem">
        <vprop:query>/ns0:itemElem/ns0:itemAvailable</vprop:query>
    </vprop:propertyAlias>
    <vprop:propertyAlias propertyName="tns:intProperty" type="xsd:int"/>
    <vprop:propertyAlias propertyName="tns:boolProperty" type="xsd:boolean"/>
</definitions>
