driver-tests/bpelse/assign/VariablePropertyTest/VariableProperty1Jbi/test/InIf3/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inif="http://j2ee.netbeans.org/wsdl/InIf3" xmlns:sim="http://xml.netbeans.org/schema/simple">
  <soapenv:Body>
    <inif:InIf3Operation>
      <inputPart>
        <sim:itemElem>
          <sim:itemName>pen</sim:itemName>
          <sim:price>15</sim:price>
          <sim:itemAvailable>false</sim:itemAvailable>
        </sim:itemElem>
      </inputPart>
    </inif:InIf3Operation>
  </soapenv:Body>
</soapenv:Envelope>